"""
Insert living_organisms
"""

from yoyo import step

__depends__ = {'20260414_03_Gp8oQ-create-living-organisms'}

steps = [
    step("""
        INSERT INTO living_organisms (name, level_id) VALUES
        -- =================== УРОВЕНЬ 1: ДОМЕН ===================
        ( 'Эукариоты', 1),               -- 3 потомка (id 2, 3)

        -- =================== УРОВЕНЬ 2: ЦАРСТВА ===================
        ( 'Животные', 2),                   -- 3 потомка (id 5, 6)
        ( 'Растения', 2),                   -- 3 потомка (id 8, 9)
        ( 'Грибы', 2),                      -- 2 потомка (id 11)

        -- =================== УРОВЕНЬ 3: ТИПЫ И ОТДЕЛЫ ===================
        -- Ветка Животных (Родитель: 2)
        ( 'Хордовые', 3),                   -- 3 потомка (id 13, 14)
        ( 'Членистоногие', 3),              -- 2 потомка (id 16)
        ( 'Моллюски', 3),                   -- ЛИСТ (0 потомков)

        -- Ветка Растений (Родитель: 3)
        ( 'Покрытосеменные', 4),            -- 2 потомка (id 18)
        ( 'Голосеменные', 4),               -- ЛИСТ (0 потомков)
        ( 'Моховидные', 4),                -- ЛИСТ (0 потомков)

        -- Ветка Грибов (Родитель: 4)
        ( 'Базидиомицеты', 4),             -- ЛИСТ
        ( 'Аскомицеты', 4),                -- ЛИСТ

        -- =================== УРОВЕНЬ 4: КЛАССЫ ===================
        -- Ветка Хордовых (Родитель: 5)
        ( 'Млекопитающие', 5),             -- 3 потомка (id 20, 21)
        ( 'Птицы', 5),                     -- 2 потомка (id 23)
        ( 'Рептилии', 5),                  -- ЛИСТ

        -- Ветка Членистоногих (Родитель: 6)
        ( 'Насекомые', 5),                 -- 3 потомка (id 25, 26)
        ( 'Паукообразные', 5),             -- ЛИСТ

        -- Ветка Покрытосеменных (Родитель: 8)
        ( 'Двудольные', 5),                -- 3 потомка (id 28, 29)
        ( 'Однодольные', 5),               -- 2 потомка (id 31)

        -- =================== УРОВЕНЬ 5: ОТРЯДЫ И ПОРЯДКИ ===================
        -- Ветка Млекопитающих (Родитель: 13)
        ( 'Приматы', 6),                  -- 2 потомка (id 33)
        ( 'Хищные', 6),                   -- 3 потомка (id 35, 36)
        ( 'Грызуны', 6),                  -- ЛИСТ

        -- Ветка Птиц и Насекомых (Родители: 14) - Делаем их листьями
        ( 'Воробьинообразные', 6),        -- ЛИСТ
        ( 'Соколообразные', 6),           -- ЛИСТ
        ( 'Жесткокрылые (Жуки)', 6),      -- ЛИСТ
        ( 'Чешуекрылые (Бабочки)', 6),    -- ЛИСТ
        ( 'Перепончатокрылые', 6),        -- ЛИСТ

        -- Ветка Двудольных растений (Родитель: 18)
        ( 'Розоцветные', 7),              -- 2 потомка (id 38)
        ( 'Астроцветные', 7),             -- ЛИСТ
        ( 'Бобовоцветные', 7),            -- ЛИСТ

        -- Ветка Однодольных растений (Родитель: 19)
        ( 'Злакоцветные', 7),             -- 2 потомка (id 40)
        ( 'Спаржецветные', 7),            -- ЛИСТ

        -- =================== УРОВЕНЬ 6: СЕМЕЙСТВА ===================
        -- Ветка Приматов (Родитель: 20)
        ( 'Гоминиды', 8),                 -- 3 потомка (id 42, 43)
        ( 'Мартышковые', 8),              -- ЛИСТ

        -- Ветка Хищных (Родитель: 21)
        ( 'Кошачьи', 8),                  -- 3 потомка (id 45, 46)
        ( 'Псовые', 8),                   -- 2 потомка (id 48)
        ( 'Медвежьи', 8),                 -- ЛИСТ

        -- Ветка Растений (Родители: 28)
        ( 'Розовые', 8),                  -- 2 потомка (id 50)
        ( 'Тутовые', 8),                  -- ЛИСТ
        ( 'Злаки', 8),                    -- 2 потомка (id 52)
        ( 'Осоковые', 8),                 -- ЛИСТ

        -- =================== УРОВЕНЬ 7: РОДЫ ===================
        -- Гоминиды (Родитель: 33)
        ( 'Люди (Homo)', 9),              -- 2 потомка (id 54)
        ( 'Шимпанзе (Pan)', 9),           -- 2 потомка (id 56)
        ( 'Гориллы (Gorilla)', 9),        -- ЛИСТ

        -- Кошачьи (Родитель: 35)
        ( 'Пантеры (Panthera)', 9),       -- 4 потомка (id 58, 59, 60) !Максимум!
        ( 'Кошки (Felis)', 9),            -- 2 потомка (id 62)
        ( 'Пумы (Puma)', 9),              -- ЛИСТ

        -- Псовые (Родитель: 36)
        ( 'Волки (Canis)', 9),            -- 2 потомка (id 64)
        ( 'Лисицы (Vulpes)', 9),          -- ЛИСТ

        -- Растения (Родители: 38)
        ( 'Яблоня (Malus)', 9),           -- 2 потомка (id 66)
        ( 'Шиповник/Роза (Rosa)', 9),     -- 2 потомка (id 68)
        ( 'Пшеница (Triticum)', 9),       -- 2 потомка (id 70)
        ( 'Кукуруза (Zea)', 9),           -- 2 потомка (id 72)

        -- =================== УРОВЕНЬ 8: ВИДЫ (ВСЕ ЛИСТЬЯ) ===================
        -- Люди (42) и Шимпанзе (43)
        ( 'Человек разумный', 10),
        ( 'Человек неандертальский', 10),
        ( 'Обыкновенный шимпанзе', 10),
        ( 'Бонобо (карликовый шимпанзе)', 10),

        -- Пантеры (45) и Кошки (46)
        ( 'Лев', 10),
        ( 'Тигр', 10),
        ( 'Ягуар', 10),
        ( 'Леопард', 10),
        ( 'Лесная кошка / Домашняя', 10),
        ( 'Камышовый кот', 10),

        -- Волки (48)
        ( 'Волк', 10),
        ( 'Койот', 10),

        -- Яблони (50) и Розы (51)
        ( 'Яблоня домашняя', 10),
        ( 'Яблоня лесная', 10),
        ( 'Шиповник собачий', 10),
        ( 'Роза галльская', 10),

        -- Пшеница (52) и Кукуруза (53)
        ( 'Пшеница мягкая', 10),
        ( 'Пшеница твердая', 10),
        ( 'Кукуруза сахарная', 10),
        ( 'Зея многолетняя (дикая)', 10);
        """,
        """
        TRUNCATE TABLE living_organisms CASCADE;
        """
    )
]
